# int - целый числа
a = 1 # у "а" тип int

# float - числа с плавающей запятой
b = 1.1 # у "b" тип float

# str - строки, представляют собой последовательность символов
c = "abs" # у "c" тип str

# list - списки, могут хранить различные типы данных
d = [1, 2.0, "qwe"] # у "d" тип list

# dict - словари, могут хранить различные типы данных в виде "ключ: значение"
e = {"a": 1, "b": 2.0, "c": "qwe", "d": [1, 2.0, "qwe"]} # у "e" тип dict

# tuple - кортежи, хранят последовательность объектов, неизменяемы
f = (1, 2.0, "hello") # у "f" тип tuple

# ыуе - кортежи, хранят последовательность уникальных объектов
g = {1, 2.0, "hello"} # у "f" тип set

# bool - логические значения True or False
h = True # у "h" тип bool
i = False # у "i" тип bool
