# сложение
print(1 + 1)
print(0 + 1)

# вычитание
print(1 - 1)
print(6 - 4)

# деление
print(6 / 2)

# умножение
print(8 * 2)

# при работе с числами типа float, ответ всегда будет типа float
print(3 + 0.1 + 2) # 5.1

# round() - позволяет округлить до кол-ва заданных знаков
print(1.2 * 3) # 3.5999999999999996
print(round(1.2 * 3, 2)) # 3.6

# остаток от деления
print(3 % 2) # будет 1

# Является ли число четным?
print(4%2==0) # True
print(3%2==0) # False

# возведение в степень
print(2**4) # 16